Programming/python/pythonTutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-03 Thu 08:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Tutorial</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hoyoul Park" />
<meta name="description" content="Org-HTML export made simple."
 />
<meta name="keywords" content="org-mode, export, html, theme, style, css, js, bigblow" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1297cf5">1. values</a></li>
<li><a href="#orgc9db68c">2. name</a></li>
<li><a href="#org49144d2">3. operator</a></li>
<li><a href="#orgeb70943">4. list</a></li>
<li><a href="#orgfebb240">5. list indexing</a></li>
<li><a href="#orgedebf48">6. list slicing(operator)</a></li>
<li><a href="#orgcfa415b">7. list operators</a></li>
<li><a href="#org50247b8">8. list 값 수정하기</a></li>
<li><a href="#orgeb28bfe">9. list 삭제</a></li>
<li><a href="#org69a0df8">10. list에 원소 추가</a></li>
<li><a href="#orgaedf456">11. list의 pop함수</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>if you want go back?  <a href="http://www.holytofrege.space/index.html">home</a></li>
</ul>
<p>
*-----&#x2013;&#x2014;
작성자: FregeHoly
작성일: <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-01-01 Tue&gt;</span></span>
작성장소: Jeju
날씨: cloudy
------&#x2013;&#x2014;*
</p>
<div id="outline-container-org1297cf5" class="outline-2">
<h2 id="org1297cf5"><span class="section-number-2">1</span> values</h2>
<div class="outline-text-2" id="text-1">
<div class="note">
<p>
python의 기본 value는 "string",number다. true나 false는 value가 아니다.
대신 True,False가 value다. 이런 기본적인 value만 있는것이 아니다. python에는
class가 있기 때문에, class의 instance도 value가 된다. programming language에선
기본적인 value조차도 내부적으론 class로 구현한다. class를 type이라고도 부를수
있는 이유다. 원래 value라는 것은 질문에 의해 시작되었다. 수많은 질문은 3가지 
종류를 나눌 수 있었으며, 그에 따른 답도 3가지였다. 그 답이 value가 된다.
</p>

<p>
아래에 value의 실행 과정을 살펴보자.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(<span style="color: #CC9393;">"string"</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(33))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(<span style="color: #BFEBBF;">True</span>))
</pre>
</div>

<p>
value라는 것은 기본적으로 immutable이라고 부른다. 이말은 value는 변경이 불가
하다는 것이다. 이건 당연한 말이다. value가 변경된다면 새로운 value가 된다.
그런데 value중에 특이한 value가 있다. 이것은 string이란 value다. string은
value이긴 하지만, character라는 또다른 value로 이루어진 data structure로 볼
수도 있다. value와 value를 모아논 data structure는 다르다. data structure는
value를 모아놓은 것이기 때문에 value들의 이동이나 삭제가 변경이 너무나 당연하다.
즉 mutable하다는 것이다. String은 grammar에서는 value로 취급하지만, 실제 구조는
data structure로 취급된다는 것이다. string은 mutable하기도 하지만, immutable
하기도 하다는 것이다.
</p>

</div>
</div>
</div>
<div id="outline-container-orgc9db68c" class="outline-2">
<h2 id="orgc9db68c"><span class="section-number-2">2</span> name</h2>
<div class="outline-text-2" id="text-2">
<div class="note">
<p>
모든 value는 답이다. 답을 안다면, 프로그래밍을 할 필요가 없다. 답은 이미 
풀려진 것이기 때문이다. 우리가 프로그래밍을 하는 이유는 모르는것을 해결하기
위한 것이다. 그렇지만, value는 필요하다. 새로운 문제를 풀기위해선 기존의
알고 있는 지식으로 부터 푼다. 따라서 우리는 기존의 답이 필요하다. 그리고 
그 답은 알기쉽게 다른 이름으로 지칭되어 사용된다. 그게 constants다. 그리고
우리가 알고자 하는 것은 variables라고 부른다.
</p>

<p>
둘다, value를 가리키는 name일 뿐이다. 
</p>

<p>
<font color="Python Tutorial"></font>
python에는 상수가 없다 한다.단지 대문자로 쓰면 된다고 한다.
변수로 쓴다.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">PI</span> = 3.14&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">PI</span> = 3.5&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(PI)
</pre>
</div>


<p>
<font color="Python Tutorial"></font>
</p>

<p>
python에서 name은 모든 value를 가리키는 이름이라는 철학을 충실히 구현하고
있는 언어다. 모든 symbol은 이름이다. 그래서 값을 가리킨다. 따라서 symbol에
상수를 뜻하는, 변수를 뜻하는 const, var과 같은 거추장 스러운것도 다 빼버렸다.
</p>

<p>
python에서 name은 그냥 쓰고 value를 가리키면 된다. 단순함의 미학이다.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">name</span> = <span style="color: #CC9393;">"hoyoul"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(name)&#57344;&#57345;&#57345;

</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-org49144d2" class="outline-2">
<h2 id="org49144d2"><span class="section-number-2">3</span> operator</h2>
<div class="outline-text-2" id="text-3">
<div class="note">
<p>
value와 structure는 뗄레야 뗄 수 없는 관계다. value가 있다면 structure가 
있을 수 밖에 없다. value만 독단적으로 있지 않다. string,number, bool과 같은 기본
value에는 structure가 없어 보이지만, 있다. set이란 structure다. 
</p>

<p>
value가 있으면, value간의 relation이 생긴다. 또한 structure가 있다면, value와
structure간의 relation이 생긴다. 우리는 이것을 operator라고 한다. operator도 relation의 일종이라서
function으로 말할 수 있다. 이런 relation은 문제해결의 중요한 역할을 한다. 예를 들어보자.
</p>
<pre class="example">
3+5=8
</pre>
<p>
위의 관계를 보면, (3,5)와 8사이에는 +란 관계가 있다. 이런 관계를 이미 
알고 있을때, 모르는 것을 구할 수 있다. 예를 들어
</p>
<pre class="example">
x + 5 = 8
</pre>
<p>
에서 우리는 x가 3이라는 것을 이전의 관계로 부터 알수 있다. 우리가 모르는 것은
이렇게 주어진 관계로 부터 찾을 수 있는 것이다.
</p>

<p>
아까 말한, 기본적인 value도 set이라는 structure를 갖는다고 했다. 이 set이라는
structure는 모든 type에 적용되는 cross-over적인 relation을 갖는다. 그 relation은
membership relation이라고 한다. operator 이기도 하다.
</p>

<p>
<font color="Python Tutorial"></font>
</p>

<p>
이제 python으로 돌아가자. 
operator는 relation이라고 했다. relation은 structure와 value와의 관계도 있고,
value와 value의 관계도 있다고 했다. 대표적인 operator를 다뤄보자.
</p>

<ol class="org-ol">
<li>numbers</li>
</ol>

<p>
:operator - +,*,-,/
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(3 + 4)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(3 - 4)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(3 * 4)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(3 / 4)
</pre>
</div>

<ol class="org-ol">
<li>bool</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #BFEBBF;">True</span> <span style="color: #F0DFAF; font-weight: bold;">and</span> <span style="color: #BFEBBF;">False</span>)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #BFEBBF;">True</span> <span style="color: #F0DFAF; font-weight: bold;">or</span> <span style="color: #BFEBBF;">False</span>)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #F0DFAF; font-weight: bold;">not</span> <span style="color: #BFEBBF;">True</span>)
</pre>
</div>

<ol class="org-ol">
<li>String</li>
</ol>

<p>
String은 predicate logic에서 사용하는 값이다. 이 값은 좀 특이하다. 이 값은
character라는 값을 모아논 data structure다. 그런데 이것이 기본 value로 
쓰이는 이유는 predicate logic에서 value는 string형태지, character형태가
아니다. value가 또 다른 value로 만들어졌다면 primitive value는 아니지만,
문법적으로는 string이 primitive value로 사용된다는 특징이 있다.
</p>

<p>
우선 string은 자연수를 domain으로 갖는 function으로 해석될 수 있다. function은
모든 value를 표현할 수 있기 때문이다. 이런 특징으로, 다음과 같은 operator를
보자.
</p>

<ol class="org-ol">
<li>string to char</li>
</ol>

<p>
String은 value이면서 data structure의 특징을 둘다 가지고 있다. immutable하면서
mutable하다. 아래는 string이 data structure의 형태를 가지고 있음을 보여준다.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">message</span> = <span style="color: #CC9393;">"Hello World"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message[0])&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">message2</span> =<span style="color: #CC9393;">"slicing example"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message2[0:7])&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">message3</span> = <span style="color: #CC9393;">"slicing example"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message3[:5])&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">message4</span> = <span style="color: #CC9393;">"slicing example"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message4[4:])&#57344;&#57345;&#57345;

</pre>
</div>

<ol class="org-ol">
<li>string replace</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">message</span> = <span style="color: #CC9393;">"Hello World"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message.replace(<span style="color: #CC9393;">"Hello"</span>,<span style="color: #CC9393;">"Hi"</span>))
</pre>
</div>

<ol class="org-ol">
<li>+</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">message</span> = <span style="color: #CC9393;">"hi"</span>&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">mname</span> = <span style="color: #CC9393;">'hoyoul'</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message + <span style="color: #CC9393;">" "</span> + mname)
</pre>
</div>

<ol class="org-ol">
<li>*</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">message</span> = <span style="color: #CC9393;">"holy"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message*2)
</pre>
</div>


<ol class="org-ol">
<li>formatting</li>
</ol>

<p>
String은 value이면서 data structure의 특징을 둘다 가지고 있다. immutable하면서
mutable하다. 
한번 예를 보자.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">immutable</span> =<span style="color: #CC9393;">"string"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(immutable[1])&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">immutable</span>[1] = <span style="color: #CC9393;">"p"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(immutable)
</pre>
</div>
<p>
에러가 난다. 값을 변경시킬수 없다고 에러가 난다. 그런데 아래를 보자.
아래는 note라는 string값에 또다른 string을 합한다. 이경우는 mutable의
예로 봐야 할까? 아니다. 아래는 변수의 특징일 뿐이다. python에는 
상수가 없기 때문에 이런현상이 일어나는 것이다. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">note</span> = <span style="color: #CC9393;">"my note"</span>&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">note</span> = note + <span style="color: #CC9393;">"attached"</span>&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(note)
</pre>
</div>

<p>
그럼 data structure의 특징인 mutable로서 string을 볼 수 있는 예가
뭐가 있을까? formatting이다. formatting은 mutalbe한 특성을 보여준다.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #CC9393;">"I eat %d apples."</span> % 3)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #CC9393;">"I eat %s apples."</span> % <span style="color: #CC9393;">"five"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(<span style="color: #CC9393;">"I eat {0} apples"</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(3))
</pre>
</div>

<p>
보듯이 string이란 value를 기술할때 %로 특정값을 집어 넣을 수 있게 했다. format
이란 함수를 써도 된다. 이것은 마치 value안에 특정 변수를 넣은것과 같다. 
그리고 % value 형태로 값을 넣는다. 이것이 mutable한 특징을 보여주는 예이다.
</p>

</div>
</div>
</div>
<div id="outline-container-orgeb70943" class="outline-2">
<h2 id="orgeb70943"><span class="section-number-2">4</span> list</h2>
<div class="outline-text-2" id="text-4">
<div class="note">
<p>
list는 data structure다. data structure는 value를 모아놓은 것이기 때문에
value다. 그래서 이름으로 가리킬 수 있다. data structure이기 때문에 type 
dependency하다. 즉 같은 type의 value만을 모아놓은 것이다. 그런데 python에선
여러 value를 다 모아 놓을 수 있다. 아래를 보자.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mystory</span> = [ 3, 4 , <span style="color: #CC9393;">"holy"</span>, <span style="color: #CC9393;">"park"</span>]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mystory)
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-orgfebb240" class="outline-2">
<h2 id="orgfebb240"><span class="section-number-2">5</span> list indexing</h2>
<div class="outline-text-2" id="text-5">
<div class="note">
<p>
function은 모든 것을 표현할 수 있다. list도 함수라는 개념으로 바라 볼 수 있다.
그것이 indexing이다. indexing은 function이지 operator는 아니다. index결과가
list라면 list operator이겠지만, value다. 이것은 function이다.&gt;
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mylist</span> = [<span style="color: #CC9393;">"one"</span>, <span style="color: #CC9393;">"two"</span>, 3, 4 ]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist[1])&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist[-1])
</pre>
</div>
<p>
indexing으로 value에 접근할 수 있다. - index도 가능하다.
</p>

<p>
indexing의 또다른 예
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">newIndex</span> =[<span style="color: #CC9393;">"one"</span>,<span style="color: #CC9393;">"two"</span>,[ 12,34]]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(newIndex[2][1])&#57344;&#57345;&#57345;

</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-orgedebf48" class="outline-2">
<h2 id="orgedebf48"><span class="section-number-2">6</span> list slicing(operator)</h2>
<div class="outline-text-2" id="text-6">
<div class="note">
<p>
slicing은 list의 특정 value를 가져오는데, list의 형태로 가져온다. list도
value이기 때문에, 이 연산은 list operator의 전형적 예다.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">message</span> = [<span style="color: #CC9393;">"one"</span>,<span style="color: #CC9393;">"two"</span>,[3 ,4]]&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message[:1])&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message[:2])&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message[:3])&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message[2][:1])
</pre>
</div>
<p>
맨 마지막 예는 중첩된 list의 slicing예를 보여준다. 다시 한번 강조하면,
slicing은 list operation이라서 list를 리턴한다.
</p>

</div>
</div>
</div>
<div id="outline-container-orgcfa415b" class="outline-2">
<h2 id="orgcfa415b"><span class="section-number-2">7</span> list operators</h2>
<div class="outline-text-2" id="text-7">
<div class="note">
<p>
list도 문자열도 simple하게 operator를 구현한다. 그것은 math의 operator를
그대로 적용한것이다.
</p>

<ol class="org-ol">
<li>+</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">message</span> = [<span style="color: #CC9393;">"msg1"</span>,<span style="color: #CC9393;">"msg2"</span>]&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">msgop</span> = [ 1,2]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(message + msgop)
</pre>
</div>

<ol class="org-ol">
<li>*</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">msg1</span> = [<span style="color: #CC9393;">"msg"</span>, <span style="color: #CC9393;">"msg2"</span>]&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">msg2</span> = [<span style="color: #CC9393;">"msg4"</span>, <span style="color: #CC9393;">"msg5"</span>]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(msg1 *2)&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(msg1*<span style="color: #CC9393;">"value"</span>)
</pre>
</div>

<p>
operator는 *는 list operator는 맞다. 하지만, list * list의 형태는 적용되지
않는다. 또한 list * "string" 형태도 되지 않는다. list * int의 형태만 가능하다.
</p>

</div>
</div>
</div>
<div id="outline-container-org50247b8" class="outline-2">
<h2 id="org50247b8"><span class="section-number-2">8</span> list 값 수정하기</h2>
<div class="outline-text-2" id="text-8">
<div class="note">
<p>
list는 data structure이기 때문에 mutable한 특징이 있다. 이것은 string이란
value와 차이가 있다. data structure의 values는 value를 모아놓은 것이기 때문에
indexing으로 value의 변경이 가능하다.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mydata</span> = [222,434,<span style="color: #CC9393;">"one"</span>,<span style="color: #CC9393;">"two"</span>]&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">mydata</span>[1] =33&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mydata)
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-orgeb28bfe" class="outline-2">
<h2 id="orgeb28bfe"><span class="section-number-2">9</span> list 삭제</h2>
<div class="outline-text-2" id="text-9">
<div class="note">
<p>
list를 삭제하는 방식은 del을 사용하거나 slicing을 사용한다.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mylist</span> = [33, 44, <span style="color: #CC9393;">"one"</span>, <span style="color: #CC9393;">"two"</span>]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">del</span> mylist[1]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mylist</span> = [<span style="color: #CC9393;">"one"</span>,2,<span style="color: #CC9393;">"three"</span>]&#57344;&#57345;&#57345;
<span style="color: #DFAF8F;">mylist</span> = mylist[1:3]&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist)
</pre>
</div>

<p>
list의 원소를 지울때, del이나 slicing을 사용할 수 있다. 또한 remove와
pop함수도 있다고 한다.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mylist</span> = [<span style="color: #CC9393;">"one"</span>,<span style="color: #CC9393;">"two"</span>, 3 , 4,<span style="color: #CC9393;">"one"</span>]&#57344;&#57345;&#57345;
mylist.remove(<span style="color: #CC9393;">"one"</span>)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist)
</pre>
</div>
<p>
del이 indexing으로 list를 삭제하는 대신에, remove는 value의 값을 
삭제한다.
</p>

</div>
</div>
</div>
<div id="outline-container-org69a0df8" class="outline-2">
<h2 id="org69a0df8"><span class="section-number-2">10</span> list에 원소 추가</h2>
<div class="outline-text-2" id="text-10">
<div class="note">
<p>
append라는 함수를 사용하면 원소 추가가 가능하다.
insert라는 함수도 가능하다.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mylist</span> = [<span style="color: #CC9393;">"one"</span>,<span style="color: #CC9393;">"two"</span>,3]&#57344;&#57345;&#57345;
mylist.append(<span style="color: #CC9393;">"known"</span>)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist)&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
mylist.insert(10,10)&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist)
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-orgaedf456" class="outline-2">
<h2 id="orgaedf456"><span class="section-number-2">11</span> list의 pop함수</h2>
<div class="outline-text-2" id="text-11">
<div class="note">
<p>
list는 stack처럼 쓸수도 있는데, pop함수가 있다. stack의 pop과 같다.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">mylist</span> = [<span style="color: #CC9393;">"one"</span>, <span style="color: #CC9393;">"two"</span>, <span style="color: #CC9393;">"three"</span>]&#57344;&#57345;&#57345;
mylist.pop()&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">print</span>(mylist)
</pre>
</div>

<p>
pop을 하면 마지막 원소를 return한다. 그리고 list는 그 원소가 삭제된 형태를
띤다. 이건 
</p>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hoyoul Park</p>
<p class="date">Created: 2019-01-03 Thu 08:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
